Varocol/MCU/STM32/STM32F103ZET6/libraries/GPIO(Support Bit-Band Operations)/GPIO.h
#ifndef __OJ_GPIO_H
#define __OJ_GPIO_H
#include "stm32f10x.h"
#include "RCC.h"
class GPIO
{
private:
    GPIO_TypeDef *GPIOx;
    GPIO_InitTypeDef GPIOInitStructure;

public:
    GPIO();
    ~GPIO();
    GPIO(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin_x);
    GPIO(GPIO_TypeDef *GPIOx, GPIO_InitTypeDef GPIOInitStructure);
    GPIO_TypeDef *Get_GPIOx();
    GPIO_InitTypeDef Get_GPIOInitStructure();
    void OUT_MODE();
    void IN_MODE();
    void Pin_On();
    void Pin_Off();
    void Set_Pin(uint8_t BitVal);
    void Set_Port(uint16_t PortVal);
    BitAction Get_Input_Pin();
    BitAction Get_Output_Pin();
    uint16_t Get_Input_Port();
    uint16_t Get_Output_Port();
    void Update(GPIO_TypeDef *GPIOx, GPIO_InitTypeDef GPIOInitStructure);
    void Set_GPIOInitStructure(GPIO_InitTypeDef GPIOInitStructure);
    void Set_GPIO(GPIO_TypeDef *GPIOx);
    void Set_GPIO_Pin(uint16_t GPIO_Pin_x);
    void Init();
    void Start();
    void ShutUp();
};
#define GPIOA_ODR_Addr (GPIOA_BASE + 12) //0X4001080C
#define GPIOB_ODR_Addr (GPIOB_BASE + 12) //0X40010C0C
#define GPIOC_ODR_Addr (GPIOC_BASE + 12) //0X4001100C
#define GPIOD_ODR_Addr (GPIOD_BASE + 12) //0X4001140C
#define GPIOE_ODR_Addr (GPIOE_BASE + 12) //0X4001180C
#define GPIOF_ODR_Addr (GPIOF_BASE + 12) //0X40011C0C
#define GPIOG_ODR_Addr (GPIOG_BASE + 12) //0X4001200C

#define GPIOA_IDR_Addr (GPIOA_BASE + 8) //0X40010808
#define GPIOB_IDR_Addr (GPIOB_BASE + 8) //0X40010C08
#define GPIOC_IDR_Addr (GPIOC_BASE + 8) //0X40011008
#define GPIOD_IDR_Addr (GPIOD_BASE + 8) //0X40011408
#define GPIOE_IDR_Addr (GPIOE_BASE + 8) //0X40011808
#define GPIOF_IDR_Addr (GPIOF_BASE + 8) //0X40011C08
#define GPIOG_IDR_Addr (GPIOG_BASE + 8) //0X40012008

#define BITBAND(addr, bitnum) ((addr & 0xF0000000) + 0x02000000 + ((addr & 0x00FFFFFF) << 5) + (bitnum << 2))
#define MEM_ADDR(addr) *((volatile unsigned long *)(addr))
#define BIT_ADDR(addr, bitnum) MEM_ADDR(BITBAND(addr, bitnum))

#define PAout(n) BIT_ADDR(GPIOA_ODR_Addr, n) //输出
#define PAin(n) BIT_ADDR(GPIOA_IDR_Addr, n)  //输入

#define PBout(n) BIT_ADDR(GPIOB_ODR_Addr, n) //输出
#define PBin(n) BIT_ADDR(GPIOB_IDR_Addr, n)  //输入

#define PCout(n) BIT_ADDR(GPIOC_ODR_Addr, n) //输出
#define PCin(n) BIT_ADDR(GPIOC_IDR_Addr, n)  //输入

#define PDout(n) BIT_ADDR(GPIOD_ODR_Addr, n) //输出
#define PDin(n) BIT_ADDR(GPIOD_IDR_Addr, n)  //输入

#define PEout(n) BIT_ADDR(GPIOE_ODR_Addr, n) //输出
#define PEin(n) BIT_ADDR(GPIOE_IDR_Addr, n)  //输入

#define PFout(n) BIT_ADDR(GPIOF_ODR_Addr, n) //输出
#define PFin(n) BIT_ADDR(GPIOF_IDR_Addr, n)  //输入

#define PGout(n) BIT_ADDR(GPIOG_ODR_Addr, n) //输出
#define PGin(n) BIT_ADDR(GPIOG_IDR_Addr, n)  //输入
#endif /* __OJ_GPIO_H*/